Merge branch 'modx-pro:master' into master
